{"plaintext":"# Frequently Asked Questions\n\n## What is D3FEND?\n\nD3FEND is a knowledge base, but more specifically a knowledge graph, of cybersecurity countermeasure techniques. In the simplest sense, it is a catalog of defensive cybersecurity techniques and their relationships to offensive/adversary techniques. The primary goal of the initial D3FEND release is to help standardize the vocabulary used to describe defensive cybersecurity technology functionality.\n\n## What is D3FEND not?\n\nD3FEND does not prescribe specific countermeasures, it does not prioritize them, and it does not characterize their effectiveness. However, standardizing the vocabulary we use to describe technical countermeasures may help us solve those problems.\n\n## Who is D3FEND for?\n\nD3FEND has multiple audiences. The most immediate is security systems architecture experts and technical executives making acquisition or investment decisions. If you need to understand how cyber defenses work in granular detail, D3FEND is meant to be a good starting point.\n\n## What are D3FEND use cases?\n\nThe dominant use case thus far has been to inform acquisition and investment. It can do this in two ways.\n\nFirst, it can be used to compare the claimed functionality in multiple product solution sets with a common defensive technique taxonomy. This makes it possible to identify product differences and product gaps relative to desired functionality in a more precise, consistent, and repeatable manner.\n\nSecond, it can suggest a potential testing scope for the defensive techniques in terms of relevant offensive techniques. This is done by identifying a product or product set's claimed defensive techniques, then querying D3FEND for the potentially related offensive techniques. An offensive test plan can be constructed by selecting combinations of the related offensive techniques. This sort of testing can be useful to determine how well a defensive product performs its claimed functionality.\n\n## What is the maturity level of D3FEND?\n\nD3FEND is at an early stage and is an experimental research project. The initial release is not considered comprehensive, and the defensive to offensive technique mappings (which are inferentially generated) are fundamentally generalizations. However, expert cybersecurity knowledge is often, at its essence, the application of fundamental computer system knowledge. We aim to codify this knowledge in our knowledge graph and expect improvement over time as the graph builds on itself.\n\n## How often is D3FEND updated?\n\nThe target update frequency will eventually be semi-annually. Though as of 2021, updates will be more frequent since the project is new and we are receiving frequent contributions from the community.\n\n## What does a listed reference in D3FEND mean or imply?\n\nD3FEND references a number of different types of internet links. For example, patents, external knowledgebases, open specficiations, and even open source code repositories. The references are used for the purposes of developing the generic countermeasure technique knowledgebase article.\n\n## Why does D3FEND reference patents?\n\nThe patent corpus was our initial focus for multiple reasons. There is strong motivation for inventors, investors, and organizations to describe and distinguish how their cybersecurity technologies work in patents. This due to the various protections patents provide for intellectual property owners. It is also a highly curated corpus with category codes, citations, and an official legally authoritative assessment of the novelty of their claims. In our experience, vendor white papers and marketing material do not sufficiently explain how the technologies work at an engineering level, nor do they do so in as uniform a manner as patents. To date, there appears to be no comprehensive public analysis of the cybersecurity patent corpus for the purpose of developing a knowledge graph of cyber countermeasures.\n\nThis corpus, while useful, has numerous issues that need to be understood when using it for our purpose. In some cases, the corpus is adversarial. For example, in academic papers, the citations tend to have high fidelity because researchers are incentivized to accurately represent prior scientific knowledge. Patents also have citations and prior art enumerations.  However, these are often selected to bolster the case that the new patent is truly novel, useful, and non-obvious for business purposes. This is done without the peer review process used in academia.\n\n## What does D3FEND stand for?\n\nDetection, Denial, and Disruption Framework Empowering Network Defense.\n\n## How can I contribute?\n\nThe D3FEND team seeks your feedback and suggestions. We know that the first version may have inconsistencies or issues, but we felt it was useful and novel enough to release to engage the community. If you have a technique which you think should be added, or you have identified an issue, please do not hesitate to send the team an email at d3fend@mitre.org. We will review and analyze submissions as time permits.\n\nIf you are recommending a new defensive technique, please ensure you include a public reference that explains how the technique works in sufficient engineering-level detail.\n"}