{"html":"<h1 id=\"d3fend-change-log\">D3FEND Change Log</h1>\n<h2 id=\"version---0100-beta-2---2022-01-31\">Version - 0.10.0-BETA-2 - 2022-01-31</h2>\n<h3 id=\"user-interface\">User Interface</h3>\n<ul>\n<li>Search feature on Digital Artifact pages.</li>\n<li>Graph neighbors section added to Digital Artifact pages to illustrate contains relationships.</li>\n<li>Digital artifact parent classes are now shown on tree view on digital artifact pages.</li>\n<li>Automatic mapping tool extracts ATT&amp;CK IDs from text and renders relevant D3FEND techniques, on resources page under tools.</li>\n<li>Contributors section on contributions page.</li>\n<li>Past releases of ontology now available on resources page.</li>\n<li>D3FEND to ATT&amp;CK Mitigations mappings on resources page.</li>\n<li>Updated relationship display logic for offensive technique and digital artifact pages. Now shows additional offensive artifacts for which there is no inferred defensive relationships.</li>\n<li>New poster generator view, link on resources page.</li>\n<li>Fixed navigation component caching issues with some technique pages.</li>\n<li>Fixed issue with offensive technique detail pages where artifacts were only shown if there was also an associated defensive technique. Now pages render all digital artifacts of the offensive technique.</li>\n<li>Fixed mobile navigation CSS issues.</li>\n<li>Fixed 404 on d3f:KerberosTicketGrantingTicket artifact page.</li>\n</ul>\n<h3 id=\"ontology-updates\">Ontology Updates</h3>\n<ul>\n<li>Refactored any &quot;create -&gt; Process&quot; relationships to &quot;invokes -&gt; Create Process&quot; where &quot;Create Process&quot; is a type of system call.</li>\n<li>ATT&amp;CK V10 included and characterized with Digital Artifacts.</li>\n<li>Refactored object property relationships for future inference support.</li>\n<li>New Defensive Techniques:<ul>\n<li>Application Configuration Hardening</li>\n<li>Domain Trust Policy</li>\n<li>User Account Permissions</li>\n<li>File Encryption</li>\n<li>System Configuration Permissions</li>\n<li>Local Account Monitoring</li>\n<li>Domain Account Monitoring</li>\n<li>Peripheral Firmware Verification</li>\n<li>System Firmware Verification</li>\n<li>IO Port Restriction</li>\n<li>System Call Filtering</li>\n<li>Credential Transmission Scoping</li>\n</ul>\n</li>\n</ul>\n<h2 id=\"version---093-beta-1---2021-07-09\">Version - 0.9.3-BETA-1 - 2021-07-09</h2>\n<h3 id=\"user-interface-1\">User Interface</h3>\n<ul>\n<li>Fuzzy search now supports synonyms for D3FEND techniques.</li>\n<li>For tactics and technique pages, render all relevant technique subclasses in table with definitons, IDs, and synonyms.</li>\n<li>Removed &quot;group&quot; concept in favor of tactic and technique routes, addresses fuzzy search wrong URL bug.</li>\n<li>Added placeholder text to search input fields.</li>\n<li>Added hyperlinks to D3FEND ID on technique page to make copy and paste easier.</li>\n</ul>\n<h3 id=\"ontology-updates-1\">Ontology Updates</h3>\n<ul>\n<li>Process Spawn Analysis kb-article inaccuracy addressed regarding a discussion of threads.</li>\n<li>Removed overly-strong assertion in Homoglyph Detection technique.</li>\n<li>Fixed identifier for IPC Traffic Analysis to &quot;D3-IPCTA&quot;.</li>\n</ul>\n<h2 id=\"version---092-beta-3---2021-06-22\">Version - 0.9.2-BETA-3 - 2021-06-22</h2>\n<h3 id=\"user-interface-2\">User Interface</h3>\n<ul>\n<li>Experiemental Digital Artifact Ontology browser.</li>\n<li>Visualize D3FEND technique to Digital Aritfact to ATT&amp;CK relationships.</li>\n<li>Renders D3FEND technique synonyms.</li>\n<li>Renders D3FEND technique IDs.</li>\n<li>Quick fuzzy search for D3FEND and ATT&amp;CK techniques.</li>\n<li>D3FEND technique pages show a clickable graph of digital artifact relationships.</li>\n<li>Visual horizontal scroll indicator on D3FEND Matrix.</li>\n<li>The D3FEND Matrix is now sorted alphabetically at the technique (2nd) level and below.</li>\n<li>New mobile navigation menu.</li>\n<li>Fixed numerous issues with display logic and CSS rending issues.</li>\n</ul>\n<h3 id=\"ontology-updates-2\">Ontology Updates</h3>\n<ul>\n<li>Many new countermeasure techniques.</li>\n<li>D3FEND Techniques now have acronym based identifiers.</li>\n<li>Major clean up of data properties and annotation properties.</li>\n<li>Many new offensive technique to digital artifact mappings.</li>\n<li>Defintions on almost all classes and puns, data, objecti, and annotation properties.</li>\n<li>Fixed latent issue from incorporating ATT&amp;CK subtechniques, removed old parent classes from some ATT&amp;CK techniques to fix display on knowledge base.</li>\n<li>Launchd vs Launch Daemon data entry error corrected.</li>\n<li>Ontology version is now depicted on d3f:D3FENDThing as owl:versionInfo.</li>\n<li>Experimental firmware taxonomy.</li>\n<li>Experimental sensor taxonomy.</li>\n</ul>\n<h2 id=\"version---091\">Version - 0.9.1</h2>\n<p>This is the first release of 2021. Our objective for this release is to mature and improve all aspects of the knowledge graph and introduce experimental inference features to aid with specific use cases. D3FEND is still an early stage project and we seek community engagement to improve the knowledge graph.</p>\n<h3 id=\"user-interface-3\">User Interface</h3>\n<ul>\n<li>Improved styling for knowledge base articles.</li>\n<li>Improved spreadsheet format, now includes technique definitions.</li>\n<li>Updated FAQ.</li>\n<li>Added the ability to hover over terms to show their definitions (if definition annotation present).</li>\n<li>Now rendering release and changelog information on the resources page.</li>\n</ul>\n<h3 id=\"new-techniques\">New Techniques</h3>\n<ul>\n<li>Last Branch Call Analysis (for ROP attack detection).</li>\n<li>Certificate Analysis techniques.</li>\n<li>Certificate Pinning.</li>\n<li>Dead Code Elimination.</li>\n</ul>\n<h3 id=\"ontology-updates-3\">Ontology Updates</h3>\n<ul>\n<li>Punned classes (OWL2-DL) to support flexibility in ontology and knowledge base use cases.</li>\n<li>Added Network Node taxonomy to articulate various types of clients, servers, and their components.</li>\n<li>Added Application taxonomy to articulate various types of common applications ranging from VCS software to server application software.</li>\n<li>Refined relationships between digital artifacts.</li>\n<li>Updated the metadata for many references.</li>\n<li>Updated to ATT&amp;CK 8.0 and developed digital artifacts where possible, more to be added in future releases.</li>\n</ul>\n<h3 id=\"improved-definitions\">Improved Definitions</h3>\n<ul>\n<li>Message Authentication.</li>\n<li>Message Encryption.</li>\n<li>DNS Denylisting techniques.</li>\n<li>Process Termination.</li>\n</ul>\n<h3 id=\"backend-updates\">Backend Updates</h3>\n<ul>\n<li>Experimental API for offensive techniques to infer defensive techniques and associate digital artifacts.</li>\n<li>Experimental API for digital artifacts to infer offensive techniques and defensive techniques.</li>\n</ul>\n<h3 id=\"limitations\">Limitations</h3>\n<ul>\n<li>Inferential reasoning about defensive and offensive relationships is experimental and will improve over time.</li>\n</ul>\n<h3 id=\"known-issues\">Known Issues</h3>\n<ul>\n<li>There are some inconsistencies in the ontology serialization files in order to accommodate backend software tooling that we intend to refine in the future.</li>\n<li>Some ontology annotations will be converted to data properties in a future release.</li>\n</ul>\n<h2 id=\"version---090\">Version - 0.9.0</h2>\n<ul>\n<li>Added DNS isolation techniques.</li>\n<li>Improved styling for knowledgebase articles.</li>\n<li>Added FAQ section.</li>\n<li>Added downloadable ontology files.</li>\n<li>Improved digital artifact relationships.</li>\n<li>Resources page includes downloads for D3FEND paper, D3FEND Ontology files, and D3FEND Spreadsheet.</li>\n</ul>\n<h2 id=\"version---001\">Version - 0.0.1</h2>\n<p>Initial release of D3FEND knowledgebase UI, ontology, and backend API.</p>\n<ul>\n<li>Countermeasure technique taxonomy portion of graph is rendered as primary home page.</li>\n<li>Ability to release static &quot;exported&quot; version of website and serve live version of website from same codebase.</li>\n<li>Basic inference for defensive techniques to related offensive techniques.</li>\n</ul>\n"}