{"@context":{"rdfs":"http://www.w3.org/2000/01/rdf-schema#","owl":"http://www.w3.org/2002/07/owl#","d3f":"http://d3fend.mitre.org/ontologies/d3fend.owl#","skos":"http://www.w3.org/2004/02/skos/core#"},"@graph":[{"@id":"d3f:ApplicationLayerFirewall","@type":"owl:Class","d3f:definition":["An application firewall is a form of firewall that controls input, output, and/or access from, to, or by an application or service. It operates by monitoring and potentially blocking the input, output, or system service calls that do not meet the configured policy of the firewall. The application firewall is typically built to control all network traffic on any OSI layer up to the application layer. It is able to control applications or services specifically, unlike a stateful network firewall, which is - without additional software - unable to control network traffic regarding a specific application. There are two primary categories of application firewalls, network-based application firewalls and host-based application firewalls."],"rdfs:hasSubClass":[{"@id":"d3f:WebApplicationFirewall"}],"rdfs:isDefinedBy":[{"@id":"http://dbpedia.org/resource/Application_firewall"}],"rdfs:label":["Application Layer Firewall"],"rdfs:subClassOf":[{"@id":"d3f:Firewall"}],"skos:altLabel":["Application Firewall"]},{"@id":"d3f:ArtifactServer","@type":"owl:Class","d3f:definition":["A digital artifact server provides access services to digital artifacts in a repository.  It provides an associated set of data management, search and access methods allowing application-independent access to the content."],"rdfs:hasSubClass":[{"@id":"d3f:DataArtifactServer"},{"@id":"d3f:SoftwareArtifactServer"}],"rdfs:label":["Artifact Server"],"rdfs:seeAlso":[{"@id":"http://dbpedia.org/resource/Content_management"},{"@id":"http://dbpedia.org/resource/Content_repository"}],"rdfs:subClassOf":[{"@id":"d3f:WebServer"}]},{"@id":"d3f:AuthenticationServer","@type":"owl:Class","d3f:definition":["An authentication server provides a network service that applications use to authenticate the credentials, usually account names and passwords, of their users. When a client submits a valid set of credentials, it receives a cryptographic ticket that it can subsequently use to access various services. Major authentication algorithms include passwords, Kerberos, and public key encryption."],"rdfs:isDefinedBy":[{"@id":"http://dbpedia.org/resource/Authentication_server"}],"rdfs:label":["Authentication Server"],"rdfs:subClassOf":[{"@id":"d3f:Server"}]},{"@id":"d3f:ClientComputer","@type":"owl:Class","d3f:definition":["A client computer is a host that accesses a service made available by a server. The server is often (but not always) on another computer system, in which case the client accesses the service by way of a network."],"rdfs:hasSubClass":[{"@id":"d3f:EmbeddedComputer"},{"@id":"d3f:PersonalComputer"},{"@id":"d3f:SharedComputer"}],"rdfs:isDefinedBy":[{"@id":"http://dbpedia.org/resource/Client_(computing)"}],"rdfs:label":["Client Computer"],"rdfs:seeAlso":[{"@id":"http://dbpedia.org/resource/Host_(network)"}],"rdfs:subClassOf":[{"@id":"d3f:Host"}]},{"@id":"d3f:ComputingServer","@type":"owl:Class","d3f:definition":["A compute server is a system specifically designed to undertake large amounts of computation, usually but not necessarily in a client/server environment."],"rdfs:isDefinedBy":[{"@id":"https://www.encyclopedia.com/computing/dictionaries-thesauruses-pictures-and-press-releases/compute-server"}],"rdfs:label":["Computing Server"],"rdfs:subClassOf":[{"@id":"d3f:Server"}]},{"@id":"d3f:DNSServer","@type":"owl:Class","d3f:definition":["A Domain Name System (DNS) name server is a kind of name server.  Domain names are one of the two principal namespaces of the Internet. The most important function of DNS servers is the translation (resolution) of human-memorable domain names and hostnames into the corresponding numeric Internet Protocol (IP) addresses, the second principal name space of the Internet which is used to identify and locate computer systems and resources on the Internet. (en).\n\nMore generally, a name server is a computer application that implements a network service for providing responses to queries against a directory service. It translates an often humanly meaningful, text-based identifier to a system-internal, often numeric identification or addressing component. This service is performed by the server in response to a service protocol request."],"rdfs:isDefinedBy":[{"@id":"http://dbpedia.org/resource/Name_server"}],"rdfs:label":["DNS Server"],"rdfs:subClassOf":[{"@id":"d3f:Server"}]},{"@id":"d3f:DataArtifactServer","@type":"owl:Class","d3f:definition":["A data artifact server provides access services to content in a content repository.  The content repository or content store is a database of digital content with an associated set of data management, search and access methods allowing application-independent access to the content, rather like a digital library, but with the ability to store and modify content in addition to searching and retrieving. The content repository acts as the storage engine for a larger application such as a content management system or a document management system, which adds a user interface on top of the repository's application programming interface."],"rdfs:label":["Data Artifact Server"],"rdfs:seeAlso":[{"@id":"http://dbpedia.org/resource/Content_repository"}],"rdfs:subClassOf":[{"@id":"d3f:ArtifactServer"}]},{"@id":"d3f:DatabaseServer","@type":["owl:NamedIndividual","owl:Class"],"d3f:contains":[{"@id":"d3f:Database"}],"d3f:definition":["A database server is a server which uses a database application that provides database services to other computer programs or to computers, as defined by the client-server model. Database management systems (DBMSs) frequently provide database-server functionality, and some database management systems (such as MySQL) rely exclusively on the client-server model for database access (while others e.g. SQLite are meant for using as an embedded database). For clarification, a database server is simply a server that maintains services related to clients via database applications."],"rdfs:isDefinedBy":[{"@id":"http://dbpedia.org/resource/Database_server"}],"rdfs:label":["Database Server"],"rdfs:subClassOf":[{"@id":"d3f:Server"},{"@id":"_:t111198"}],"skos:altLabel":["Network Database Resource"]},{"@id":"d3f:DesktopComputer","@type":"owl:Class","d3f:definition":["A desktop computer is a personal computer designed for regular use at a single location on or near a desk or table due to its size and power requirements. The most common configuration has a case that houses the power supply, motherboard (a printed circuit board with a microprocessor as the central processing unit (CPU), memory, bus, and other electronic components, disk storage (usually one or more hard disk drives, solid state drives, optical disc drives, and in early models a floppy disk drive); a keyboard and mouse for input; and a computer monitor, speakers, and, often, a printer for output. The case may be oriented horizontally or vertically and placed either underneath, beside, or on top of a desk."],"rdfs:isDefinedBy":[{"@id":"http://dbpedia.org/resource/Desktop_computer"}],"rdfs:label":["Desktop Computer"],"rdfs:subClassOf":[{"@id":"d3f:PersonalComputer"}]},{"@id":"d3f:DialUpModem","@type":"owl:Class","d3f:definition":["A dial-up modem transmits computer data over an ordinary switched telephone line that has not been designed for data use. This contrasts with leased line modems, which also operate over lines provided by a telephone company, but ones which are intended for data use and do not impose the same signaling constraints. The modulated data must fit the frequency constraints of a normal voice audio signal, and the modem must be able to perform the actions needed to connect a call through a telephone exchange, namely: picking up the line, dialing, understanding signals sent back by phone company equipment (dial tone, ringing, busy signal,) and on the far end of the call, the second modem in the connection must be able to recognize the incoming ring signal and answer the line."],"rdfs:isDefinedBy":[{"@id":"http://dbpedia.org/resource/Modem#Dial-up"}],"rdfs:label":["Dial Up Modem"],"rdfs:subClassOf":[{"@id":"d3f:Modem"}]},{"@id":"d3f:EmbeddedComputer","@type":"owl:Class","d3f:definition":["An embedded computer is a computer system -- a combination of a computer processor, computer memory, and input/output peripheral devices-that has a dedicated function within a larger mechanical or electrical system. It is embedded as part of a complete device often including electrical or electronic hardware and mechanical parts. Because an embedded system typically controls physical operations of the machine that it is embedded within, it often has real-time computing constraints. Embedded systems control many devices in common use today. Ninety-eight percent of all microprocessors manufactured are used in embedded systems."],"rdfs:isDefinedBy":[{"@id":"http://dbpedia.org/resource/Embedded_system"}],"rdfs:label":["Embedded Computer"],"rdfs:subClassOf":[{"@id":"d3f:ClientComputer"}],"skos:altLabel":["Embedded System"]},{"@id":"d3f:FileServer","@type":["owl:NamedIndividual","owl:Class"],"d3f:definition":["The term server highlights the role of the machine in the traditional client-server scheme, where the clients are the workstations using the storage. A file server does not normally perform computational tasks or run programs on behalf of its client workstations. File servers are commonly found in schools and offices, where users use a local area network to connect their client computers."],"rdfs:isDefinedBy":[{"@id":"http://dbpedia.org/resource/File_server"}],"rdfs:label":["File Server"],"rdfs:subClassOf":[{"@id":"d3f:Server"}]},{"@id":"d3f:Firewall","@type":"owl:Class","d3f:definition":["In computing, a firewall is a network security system that monitors and controls incoming and outgoing network traffic based on predetermined security rules. A firewall typically establishes a barrier between a trusted internal network and untrusted external network, such as the Internet. Firewalls are often categorized as either network firewalls or host-based firewalls. Network firewalls filter traffic between two or more networks and run on network hardware. Host-based firewalls run on host computers and control network traffic in and out of those machines. This definition refers to network firewalls."],"rdfs:hasSubClass":[{"@id":"d3f:ApplicationLayerFirewall"}],"rdfs:label":["Firewall"],"rdfs:seeAlso":[{"@id":"http://dbpedia.org/resource/Firewall_(computing)"}],"rdfs:subClassOf":[{"@id":"d3f:NetworkNode"}],"skos:altLabel":["Network Firewall"]},{"@id":"d3f:ForwardProxyServer","@type":"owl:Class","d3f:definition":["An forward (or open) proxy is a proxy server that is accessible by any Internet user. Generally, a proxy server only allows users within a network group (i.e. a closed proxy) to store and forward Internet services such as DNS or web pages to reduce and control the bandwidth used by the group. With an open proxy, however, any user on the Internet is able to use this forwarding service."],"rdfs:isDefinedBy":[{"@id":"http://dbpedia.org/resource/Open_proxy"}],"rdfs:label":["Forward Proxy Server"],"rdfs:subClassOf":[{"@id":"d3f:ProxyServer"}]},{"@id":"d3f:Host","@type":["owl:NamedIndividual","owl:Class"],"d3f:contains":[{"@id":"d3f:Application"},{"@id":"d3f:OperatingSystem"}],"d3f:definition":["A host is a computer or other device, typically connected to a computer network. A network host may offer information resources, services, and applications to users or other nodes on the network. A network host is a network node that is assigned a network layer host address. Network hosts that participate in applications that use the client-server model of computing, are classified as server or client systems. Network hosts may also function as nodes in peer-to-peer applications, in which all nodes share and consume resources in an equipotent manner."],"d3f:runs":[{"@id":"d3f:OperatingSystem"}],"rdfs:hasSubClass":[{"@id":"d3f:ClientComputer"},{"@id":"d3f:Server"}],"rdfs:isDefinedBy":[{"@id":"http://dbpedia.org/resource/Host_(network)"}],"rdfs:label":["Host"],"rdfs:subClassOf":[{"@id":"d3f:NetworkNode"},{"@id":"_:t111770"},{"@id":"_:t111989"},{"@id":"_:t111993"}],"skos:altLabel":["Network Host"]},{"@id":"d3f:IPPhone","@type":"owl:Class","d3f:definition":["A VoIP phone or IP phone uses voice over IP technologies for placing and transmitting telephone calls over an IP network, such as the Internet, instead of the traditional public switched telephone network (PSTN). Digital IP-based telephone service uses control protocols such as the Session Initiation Protocol (SIP), Skinny Client Control Protocol (SCCP) or various other proprietary protocols."],"rdfs:isDefinedBy":[{"@id":"http://dbpedia.org/resource/VoIP_phone"}],"rdfs:label":["IP Phone"],"rdfs:subClassOf":[{"@id":"d3f:PersonalComputer"}],"skos:altLabel":["VoIP Phone"]},{"@id":"d3f:KioskComputer","@type":"owl:Class","d3f:definition":["An interactive kiosk is a computer terminal featuring specialized hardware and software that provides access to information and applications for communication, commerce, entertainment, or education. Early interactive kiosks sometimes resembled telephone booths, but have been embraced by retail, food service and hospitality to improve customer service and streamline operations. Interactive kiosks are typically placed in high foot traffic settings such as shops, hotel lobbies or airports."],"rdfs:isDefinedBy":[{"@id":"http://dbpedia.org/resource/Interactive_kiosk"}],"rdfs:label":["Kiosk Computer"],"rdfs:subClassOf":[{"@id":"d3f:SharedComputer"}],"skos:altLabel":["Interactive Kiosk"]},{"@id":"d3f:LaptopComputer","@type":"owl:Class","d3f:definition":["A laptop computer (also laptop), is a small, portable personal computer (PC) with a \"clamshell\" form factor, typically having a thin LCD or LED computer screen mounted on the inside of the upper lid of the clamshell and an alphanumeric keyboard on the inside of the lower lid. The clamshell is opened up to use the computer. Laptops are folded shut for transportation, and thus are suitable for mobile use. Its name comes from lap, as it was deemed to be placed on a person's lap when being used. Although originally there was a distinction between laptops and notebooks (the former being bigger and heavier than the latter), as of 2014, there is often no longer any difference. Today, laptops are commonly used in a variety of settings, such as at work, in education, for playing games, web browsing"],"rdfs:isDefinedBy":[{"@id":"http://dbpedia.org/resource/Laptop"}],"rdfs:label":["Laptop Computer"],"rdfs:subClassOf":[{"@id":"d3f:PersonalComputer"}],"skos:altLabel":["Laptop","Notebook"]},{"@id":"d3f:MailServer","@type":["owl:NamedIndividual","owl:Class"],"d3f:definition":["Within the Internet email system, a message transfer agent or mail transfer agent (MTA) or mail relay is software that transfers electronic mail messages from one computer to another using SMTP. The terms mail server, mail exchanger, and MX host are also used in some contexts. Messages exchanged across networks are passed between mail servers, including any attached data files (such as images, multimedia or documents). These servers also often keep mailboxes for email. Access to this email by end users is typically either via webmail or an email client."],"d3f:runs":[{"@id":"d3f:MessageTransferAgent"}],"rdfs:isDefinedBy":[{"@id":"http://dbpedia.org/resource/Message_transfer_agent"}],"rdfs:label":["Mail Server"],"rdfs:subClassOf":[{"@id":"d3f:Server"},{"@id":"_:t111818"}],"skos:altLabel":["Email Server Resource","Mail Exchanger","Mail transfer agent","Message transfer agent","MTA","MX Host"]},{"@id":"d3f:MediaServer","@type":"owl:Class","d3f:definition":["A media server is a computer appliance or an application software that stores digital media (video, audio or images) and makes it available over a network. Media servers range from servers that provide video on demand to smaller personal computers or NAS (Network Attached Storage) for the home."],"rdfs:isDefinedBy":[{"@id":"http://dbpedia.org/resource/Media_server"}],"rdfs:label":["Media Server"],"rdfs:subClassOf":[{"@id":"d3f:Server"}]},{"@id":"d3f:MobilePhone","@type":"owl:Class","d3f:definition":["A mobile phone, cellular phone, cell phone, cellphone or hand phone, sometimes shortened to simply mobile, cell or just phone, is a portable telephone that can make and receive calls over a radio frequency link while the user is moving within a telephone service area. The radio frequency link establishes a connection to the switching systems of a mobile phone operator, which provides access to the public switched telephone network (PSTN). Modern mobile telephone services use a cellular network architecture and, therefore, mobile telephones are called cellular telephones or cell phones in North America. In addition to telephony, digital mobile phones (2G) support a variety of other services, such as text messaging, MMS, email, Internet access, short-range wireless communications (infrared,"],"rdfs:isDefinedBy":[{"@id":"http://dbpedia.org/resource/Mobile_phone"}],"rdfs:label":["Mobile Phone"],"rdfs:subClassOf":[{"@id":"d3f:PersonalComputer"}],"skos:altLabel":["Cellphone","Cellular Phone"]},{"@id":"d3f:Modem","@type":"owl:Class","d3f:definition":["A modem -- a portmanteau of \"modulator-demodulator\" -- is a hardware device that converts data into a format suitable for a transmission medium so that it can be transmitted from one computer to another (historically along telephone wires). A modem modulates one or more carrier wave signals to encode digital information for transmission and demodulates signals to decode the transmitted information. The goal is to produce a signal that can be transmitted easily and decoded reliably to reproduce the original digital data. Modems can be used with almost any means of transmitting analog signals from light-emitting diodes to radio. A common type of modem is one that turns the digital data of a computer into modulated electrical signal for transmission over telephone lines and demodulated by another modem at the receiver side to recover the digital data."],"rdfs:hasSubClass":[{"@id":"d3f:DialUpModem"},{"@id":"d3f:OpticalModem"},{"@id":"d3f:RadioModem"}],"rdfs:isDefinedBy":[{"@id":"http://dbpedia.org/resource/Modem"}],"rdfs:label":["Modem"],"rdfs:subClassOf":[{"@id":"d3f:NetworkNode"}]},{"@id":"d3f:NetworkNode","@type":["owl:NamedIndividual","owl:Class"],"d3f:definition":["In telecommunications networks, a node (Latin nodus, 'knot') is either a redistribution point or a communication endpoint. The definition of a node depends on the network and protocol layer referred to. A physical network node is an electronic device that is attached to a network, and is capable of creating, receiving, or transmitting information over a communications channel. A passive distribution point such as a distribution frame or patch panel is consequently not a node."],"d3f:runs":[{"@id":"d3f:OperatingSystem"}],"rdfs:hasSubClass":[{"@id":"d3f:Host"},{"@id":"d3f:Modem"},{"@id":"d3f:Firewall"},{"@id":"d3f:ProxyServer"},{"@id":"d3f:Router"},{"@id":"d3f:Switch"},{"@id":"d3f:WirelessAccessPoint"},{"@id":"d3f:RFNode"}],"rdfs:isDefinedBy":[{"@id":"http://dbpedia.org/resource/Node_(networking)"}],"rdfs:label":["Network Node"],"rdfs:subClassOf":[{"@id":"d3f:DigitalArtifact"},{"@id":"_:t112107"}]},{"@id":"d3f:NetworkPrinter","@type":"owl:Class","d3f:definition":["In computing, a network printer is a device that can be accessed over a network which makes a persistent representation of graphics or text, usually on paper. While most output is human-readable, bar code printers are an example of an expanded use for printers. The different types of printers include 3D printer, inkjet printer, laser printer, thermal printer, etc.  Note that not all printers are networked and the digital information to be printed must be passed either by removable media or as directly connecting the printer to a computer (e.g., by USB.)"],"rdfs:isDefinedBy":[{"@id":"http://dbpedia.org/resource/Printer_(computing)"}],"rdfs:label":["Network Printer"],"rdfs:subClassOf":[{"@id":"d3f:SharedComputer"}]},{"@id":"d3f:OperationsCenterComputer","@type":"owl:Class","d3f:definition":["Mainframe computers or mainframes (colloquially referred to as \"big iron\") are computers used primarily by large organizations for critical applications; bulk data processing, such as census, industry and consumer statistics, and enterprise resource planning; and transaction processing. They are larger and have more processing power than some other classes of computers: minicomputers, servers, workstations, and personal computers."],"rdfs:isDefinedBy":[{"@id":"http://dbpedia.org/resource/Mainframe_computer"}],"rdfs:label":["Operations Center Computer"],"rdfs:seeAlso":[{"@id":"http://dbpedia.org/resource/Time-sharing"}],"rdfs:subClassOf":[{"@id":"d3f:SharedComputer"}],"skos:altLabel":["Mainframe"]},{"@id":"d3f:OpticalModem","@type":"owl:Class","d3f:definition":["A modem that connects to a fiber optic network is known as an optical network terminal (ONT) or optical network unit (ONU). These are commonly used in fiber to the home installations, installed inside or outside a house to convert the optical medium to a copper Ethernet interface, after which a router or gateway is often installed to perform authentication, routing, NAT, and other typical consumer internet functions, in addition to \"triple play\" features such as telephony and television service."],"rdfs:isDefinedBy":[{"@id":"http://dbpedia.org/resource/Modem#Optical_modem"}],"rdfs:label":["Optical Modem"],"rdfs:subClassOf":[{"@id":"d3f:Modem"}]},{"@id":"d3f:OrchestrationController","@type":["owl:NamedIndividual","owl:Class"],"d3f:contains":[{"@id":"d3f:ContainerOrchestrationSoftware"}],"d3f:definition":["An orchestration server provides orchestration services that automate the configuration, coordination, and management of computer systems and software."],"rdfs:label":["Orchestration Controller"],"rdfs:subClassOf":[{"@id":"d3f:OrchestrationServer"},{"@id":"_:t111665"}]},{"@id":"d3f:OrchestrationServer","@type":"owl:Class","d3f:definition":["A d3f:Server which is involved with the orchestration of workloads or the execution of orchestrated workloads."],"rdfs:hasSubClass":[{"@id":"d3f:OrchestrationController"},{"@id":"d3f:OrchestrationWorker"}],"rdfs:label":["Orchestration Server"],"rdfs:seeAlso":[{"@id":"http://dbpedia.org/resource/Orchestration_(computing)"}],"rdfs:subClassOf":[{"@id":"d3f:Server"}]},{"@id":"d3f:OrchestrationWorker","@type":"owl:Class","d3f:definition":["A d3f:Server which receives commands from a d3f:OrchestrationController to execute workloads."],"rdfs:label":["Orchestration Worker"],"rdfs:seeAlso":["d3f:OrchestrationController"],"rdfs:subClassOf":[{"@id":"d3f:OrchestrationServer"}]},{"@id":"d3f:PersonalComputer","@type":"owl:Class","d3f:definition":["A personal computer (PC) is a multi-purpose computer whose size, capabilities, and price make it feasible for individual use. Personal computers are intended to be operated directly by an end user, rather than by a computer expert or technician. Unlike large, costly minicomputers and mainframes, time-sharing by many people at the same time is not used with personal computers. PCs have in practice become powerful enough that they may be shared by multiple users at any given time, though this is not common practice nor the primary purpose of a PC."],"rdfs:hasSubClass":[{"@id":"d3f:IPPhone"},{"@id":"d3f:LaptopComputer"},{"@id":"d3f:MobilePhone"},{"@id":"d3f:DesktopComputer"},{"@id":"d3f:TabletComputer"}],"rdfs:isDefinedBy":[{"@id":"http://dbpedia.org/resource/Personal_computer"}],"rdfs:label":["Personal Computer"],"rdfs:subClassOf":[{"@id":"d3f:ClientComputer"}]},{"@id":"d3f:PrintServer","@type":"owl:Class","d3f:definition":["A print server, or printer server, is a device that connects printers to client computers over a network. It accepts print jobs from the computers and sends the jobs to the appropriate printers, queuing the jobs locally to accommodate the fact that work may arrive more quickly than the printer can actually handle."],"rdfs:isDefinedBy":[{"@id":"http://dbpedia.org/resource/Print_server"}],"rdfs:label":["Print Server"],"rdfs:subClassOf":[{"@id":"d3f:Server"}]},{"@id":"d3f:ProxyServer","@type":"owl:Class","d3f:definition":["In computer networking, a proxy server is a server application or appliance that acts as an intermediary for requests from clients seeking resources from servers that provide those resources. A proxy server thus functions on behalf of the client when requesting service, potentially masking the true origin of the request to the resource server."],"rdfs:hasSubClass":[{"@id":"d3f:ForwardProxyServer"},{"@id":"d3f:ReverseProxyServer"}],"rdfs:isDefinedBy":[{"@id":"http://dbpedia.org/resource/Proxy_server"}],"rdfs:label":["Proxy Server"],"rdfs:subClassOf":[{"@id":"d3f:NetworkNode"},{"@id":"d3f:Server"}]},{"@id":"d3f:RFNode","@type":"owl:Class","rdfs:hasSubClass":[{"@id":"d3f:RFTransceiver"},{"@id":"d3f:RFReceiver"},{"@id":"d3f:RFTransmitter"}],"rdfs:label":["RF Node"],"rdfs:subClassOf":[{"@id":"d3f:NetworkNode"}]},{"@id":"d3f:RFReceiver","@type":"owl:Class","rdfs:label":["RF Receiver"],"rdfs:subClassOf":[{"@id":"d3f:RFNode"}]},{"@id":"d3f:RFTransceiver","@type":"owl:Class","rdfs:hasSubClass":[{"@id":"d3f:WirelessAccessPoint"}],"rdfs:label":["RF Transceiver"],"rdfs:subClassOf":[{"@id":"d3f:RFNode"}]},{"@id":"d3f:RFTransmitter","@type":"owl:Class","rdfs:label":["RF Transmitter"],"rdfs:subClassOf":[{"@id":"d3f:RFNode"}]},{"@id":"d3f:RadioModem","@type":"owl:Class","d3f:definition":["A radio modem provides the means to send digital data wirelessly.  Radio modems are used to communicate by direct broadcast satellite, WiFi, WiMax, mobile phones, GPS, Bluetooth and NFC. Modern telecommunications and data networks also make extensive use of radio modems where long distance data links are required. Such systems are an important part of the PSTN, and are also in common use for high-speed computer network links to outlying areas where fiber optic is not economical."],"rdfs:isDefinedBy":[{"@id":"http://dbpedia.org/resource/Modem#Radio"}],"rdfs:label":["Radio Modem"],"rdfs:subClassOf":[{"@id":"d3f:Modem"}]},{"@id":"d3f:ReverseProxyServer","@type":"owl:Class","d3f:definition":["In computer networks, a reverse proxy is a type of proxy server that retrieves resources on behalf of a client from one or more servers. These resources are then returned to the client, appearing as if they originated from the proxy server itself. Unlike a forward proxy, which is an intermediary for its associated clients to contact any server, a reverse proxy is an intermediary for its associated servers to be contacted by any client. In other words, a proxy acts on behalf of the client(s), while a reverse proxy acts on behalf of the server(s); a reverse proxy is usually an internal-facing proxy used as a 'front-end' to control and protect access to a server on a private network."],"rdfs:isDefinedBy":[{"@id":"http://dbpedia.org/resource/Reverse_proxy"}],"rdfs:label":["Reverse Proxy Server"],"rdfs:subClassOf":[{"@id":"d3f:ProxyServer"}]},{"@id":"d3f:Router","@type":"owl:Class","d3f:definition":["A router is a networking device that forwards data packets between computer networks. Routers perform the traffic directing functions on the Internet. Data sent through the internet, such as a web page or email, is in the form of data packets. A packet is typically forwarded from one router to another router through the networks that constitute an internetwork (e.g. the Internet) until it reaches its destination node."],"rdfs:hasSubClass":[{"@id":"d3f:WirelessRouter"}],"rdfs:isDefinedBy":[{"@id":"http://dbpedia.org/resource/Router_(computing)"}],"rdfs:label":["Router"],"rdfs:subClassOf":[{"@id":"d3f:NetworkNode"}]},{"@id":"d3f:Server","@type":["owl:NamedIndividual","owl:Class"],"d3f:definition":["In computing, a server is a piece of computer hardware or software (computer program) that provides functionality for other programs or devices, called \"clients\". This architecture is called the client-server model. Servers can provide various functionalities, often called \"services\", such as sharing data or resources among multiple clients, or performing computation for a client. A single server can serve multiple clients, and a single client can use multiple servers. A client process may run on the same device or may connect over a network to a server on a different device. Typical servers are database servers, file servers, mail servers, print servers, web servers, game servers, and application servers."],"d3f:manages":[{"@id":"d3f:ServiceApplicationProcess"}],"d3f:runs":[{"@id":"d3f:ServiceApplication"}],"rdfs:hasSubClass":[{"@id":"d3f:AuthenticationServer"},{"@id":"d3f:ComputingServer"},{"@id":"d3f:DatabaseServer"},{"@id":"d3f:DNSServer"},{"@id":"d3f:FileServer"},{"@id":"d3f:OrchestrationServer"},{"@id":"d3f:PrintServer"},{"@id":"d3f:ProxyServer"},{"@id":"d3f:MailServer"},{"@id":"d3f:MediaServer"},{"@id":"d3f:VPNServer"},{"@id":"d3f:WebServer"}],"rdfs:isDefinedBy":[{"@id":"http://dbpedia.org/resource/Server_(computing)"}],"rdfs:label":["Server"],"rdfs:subClassOf":[{"@id":"_:t112126"},{"@id":"_:t112201"},{"@id":"d3f:Host"},{"@id":"d3f:NetworkResource"}]},{"@id":"d3f:SharedComputer","@type":"owl:Class","d3f:definition":["A computer whose resources are intended to be shared widely."],"rdfs:hasSubClass":[{"@id":"d3f:KioskComputer"},{"@id":"d3f:NetworkPrinter"},{"@id":"d3f:OperationsCenterComputer"},{"@id":"d3f:ThinClientComputer"}],"rdfs:label":["Shared Computer"],"rdfs:seeAlso":[{"@id":"http://dbpedia.org/resource/Time-sharing"}],"rdfs:subClassOf":[{"@id":"d3f:ClientComputer"}]},{"@id":"d3f:SoftwareArtifactServer","@type":"owl:Class","d3f:definition":["A software artifact server provides access to the software artifacts in a software repository. A software repository, or \"repo\" for short, is a storage location for software packages. Often a table of contents is stored, as well as metadata. Repositories group packages. Sometimes the grouping is for a programming language, such as CPAN for the Perl programming language, sometimes for an entire operating system, sometimes the license of the contents is the criteria. At client side, a package manager helps installing from and updating the repositories."],"rdfs:label":["Software Artifact Server"],"rdfs:seeAlso":[{"@id":"http://dbpedia.org/resource/Artifact_(software_development)"},{"@id":"http://dbpedia.org/resource/Software_repository"}],"rdfs:subClassOf":[{"@id":"d3f:ArtifactServer"}]},{"@id":"d3f:Switch","@type":"owl:Class","d3f:definition":["A network switch (also called switching hub, bridging hub, and by the IEEE MAC bridge) is networking hardware that connects devices on a computer network by using packet switching to receive and forward data to the destination device. A network switch is a multiport network bridge that uses MAC addresses to forward data at the data link layer (layer 2) of the OSI model. Some switches can also forward data at the network layer (layer 3) by additionally incorporating routing functionality. Such switches are commonly known as layer-3 switches or multilayer switches."],"rdfs:isDefinedBy":[{"@id":"http://dbpedia.org/resource/Network_switch"}],"rdfs:label":["Switch"],"rdfs:subClassOf":[{"@id":"d3f:NetworkNode"}],"skos:altLabel":["Bridging Hub","MAC Bridge","Network Switch","Switching Hub"]},{"@id":"d3f:TabletComputer","@type":"owl:Class","d3f:definition":["A tablet computer, commonly shortened to tablet, is a mobile device, typically with a mobile operating system and touchscreen display processing circuitry, and a rechargeable battery in a single, thin and flat package. Tablets, being computers, do what other personal computers do, but lack some input/output (I/O) abilities that others have. Modern tablets largely resemble modern smartphones, the only differences being that tablets are relatively larger than smartphones, with screens 7 inches (18 cm) or larger, measured diagonally, and may not support access to a cellular network."],"rdfs:isDefinedBy":[{"@id":"http://dbpedia.org/resource/Tablet_computer"}],"rdfs:label":["Tablet Computer"],"rdfs:subClassOf":[{"@id":"d3f:PersonalComputer"}],"skos:altLabel":["Tablet"]},{"@id":"d3f:ThinClientComputer","@type":"owl:Class","d3f:definition":["A thin client is a lightweight computer that has been optimized for establishing a remote connection with a server-based computing environment. The server does most of the work, which can include launching software programs, performing calculations, and storing data. This contrasts with a fat client or a conventional personal computer; the former is also intended for working in a client-server model but has significant local processing power, while the latter aims to perform its function mostly locally. Thin clients are shared computers as the thin client's computing resources are provided by a remote server."],"rdfs:hasSubClass":[{"@id":"d3f:ZeroClientComputer"}],"rdfs:isDefinedBy":[{"@id":"http://dbpedia.org/resource/Thin_client"}],"rdfs:label":["Thin Client Computer"],"rdfs:subClassOf":[{"@id":"d3f:SharedComputer"}]},{"@id":"d3f:VPNServer","@type":"owl:Class","d3f:definition":["A VPN server is a type of server that enables hosting and delivery of VPN services.\n\nIt is a combination of VPN hardware and software technologies that provides VPN clients with connectivity to a secure and/or private network, or rather, the VPN."],"rdfs:isDefinedBy":[{"@id":"https://www.techopedia.com/definition/30750/vpn-server"}],"rdfs:label":["VPN Server"],"rdfs:seeAlso":[{"@id":"http://dbpedia.org/resource/Virtual_private_network"}],"rdfs:subClassOf":[{"@id":"d3f:Server"}]},{"@id":"d3f:WebApplicationFirewall","@type":"owl:Class","d3f:definition":["A web application firewall (or WAF) filters, monitors, and blocks HTTP traffic to and from a web application. A WAF is differentiated from a regular firewall in that a WAF is able to filter the content of specific web applications while regular firewalls serve as a safety gate between servers. By inspecting HTTP traffic, it can prevent attacks stemming from web application security flaws, such as SQL injection, cross-site scripting (XSS), file inclusion, and security misconfigurations."],"rdfs:isDefinedBy":[{"@id":"http://dbpedia.org/resource/Web_application_firewall"}],"rdfs:label":["Web Application Firewall"],"rdfs:subClassOf":[{"@id":"d3f:ApplicationLayerFirewall"}],"skos:altLabel":["WAF"]},{"@id":"d3f:WebApplicationServer","@type":"owl:Class","d3f:definition":["A web application server is a web server that hosts applications. Application server frameworks are software frameworks for building application servers. An application server framework provides both facilities to create web applications and a server environment to run them. In the case of Java application servers, the server behaves like an extended virtual machine for running applications, transparently handling connections to the database on one side, and, often, connections to the Web client on the other."],"rdfs:isDefinedBy":[{"@id":"http://dbpedia.org/resource/Application_server"}],"rdfs:label":["Web Application Server"],"rdfs:subClassOf":[{"@id":"d3f:WebServer"}]},{"@id":"d3f:WebServer","@type":["owl:NamedIndividual","owl:Class"],"d3f:definition":["A web server is server software, or hardware dedicated to running this software, that can satisfy client requests on the World Wide Web. A web server can, in general, contain one or more websites. A web server processes incoming network requests over HTTP and several other related protocols. While the major function is to serve content, a full implementation of HTTP also includes ways of receiving content from clients. This feature is used for submitting web forms, including uploading of files."],"rdfs:hasSubClass":[{"@id":"d3f:ArtifactServer"},{"@id":"d3f:WebApplicationServer"}],"rdfs:isDefinedBy":[{"@id":"http://dbpedia.org/resource/Web_server"}],"rdfs:label":["Web Server"],"rdfs:subClassOf":[{"@id":"d3f:Server"}]},{"@id":"d3f:WirelessAccessPoint","@type":"owl:Class","d3f:definition":["In computer networking, a wireless access point (WAP), or more generally just access point (AP), is a networking hardware device that allows other Wi-Fi devices to connect to a wired network. The AP usually connects to a router (via a wired network) as a standalone device, but it can also be an integral component of the router itself. An AP is differentiated from a hotspot which is a physical location where Wi-Fi access is available."],"rdfs:hasSubClass":[{"@id":"d3f:WirelessRouter"}],"rdfs:isDefinedBy":[{"@id":"http://dbpedia.org/resource/Wireless_access_point"}],"rdfs:label":["Wireless Access Point"],"rdfs:subClassOf":[{"@id":"d3f:NetworkNode"},{"@id":"d3f:RFTransceiver"}],"skos:altLabel":["WAP"]},{"@id":"d3f:WirelessRouter","@type":"owl:Class","d3f:definition":["A wireless router is a device that performs the functions of a router and also includes the functions of a wireless access point. It is used to provide access to the Internet or a private computer network. Depending on the manufacturer and model, it can function in a wired local area network, in a wireless-only LAN, or in a mixed wired and wireless network."],"rdfs:isDefinedBy":[{"@id":"http://dbpedia.org/resource/Wireless_router"}],"rdfs:label":["Wireless Router"],"rdfs:seeAlso":["Wireless Access Point"],"rdfs:subClassOf":[{"@id":"d3f:Router"},{"@id":"d3f:WirelessAccessPoint"}]},{"@id":"d3f:ZeroClientComputer","@type":"owl:Class","d3f:definition":["Zero client is also referred as ultra thin client, contains no moving parts but centralizes all processing and storage to just what is running on the server. As a result, it requires no local driver to install, no patch management, and no local operating system licensing fees or updates. The device consumes very little power and is tamper-resistant and completely incapable of storing any data locally, providing a more secure endpoint."],"rdfs:isDefinedBy":[{"@id":"http://dbpedia.org/resource/Thin_client#Zero_client"}],"rdfs:label":["Zero Client Computer"],"rdfs:subClassOf":[{"@id":"d3f:ThinClientComputer"}]}]}