{"def_to_off":{"head":{"vars":["query_def_tech_label","top_def_tech_label","def_tactic_label","def_tactic_rel_label","def_tech_label","def_artifact_rel_label","def_artifact_label","off_artifact_label","off_artifact_rel_label","off_tech_label","off_tech_id","off_tech_parent_label","off_tech_parent_is_toplevel","off_tactic_rel_label","off_tactic_label","def_tactic","def_tactic_rel","tactic_def_tech","def_tech","def_artifact_rel","def_artifact","off_artifact","off_artifact_rel","off_tech","off_tech_parent","off_tactic_rel","off_tactic"]},"results":{"bindings":[]}},"description":{"@context":{"rdfs":"http://www.w3.org/2000/01/rdf-schema#","owl":"http://www.w3.org/2002/07/owl#","d3f":"http://d3fend.mitre.org/ontologies/d3fend.owl#","skos":"http://www.w3.org/2004/02/skos/core#"},"@graph":[{"@id":"d3f:OperationalRiskAssessment","@type":["owl:NamedIndividual","d3f:OperationalActivityMapping","owl:Class"],"d3f:d3fend-id":"D3-ORA","d3f:definition":"Operational risk assessment identifies and models the vulnerabilities of, and risks to, an organization's activities individually and as a whole.","d3f:evaluates":{"@id":"d3f:Organization"},"d3f:identifies":{"@id":"d3f:Vulnerability"},"d3f:kb-reference":[{"@id":"d3f:Reference-MGT516ManagingSecurityVulnerabilitiesEnterpriseAndCloud"},{"@id":"d3f:Reference-NIST-RMF-Quick-Start-Guide-Assess-Step-FAQ"},{"@id":"d3f:Reference-NIST-Special-Publication-800-160-Volume-1"},{"@id":"d3f:Reference-NIST-Special-Publication-800-37-Revision-2"},{"@id":"d3f:Reference-NIST-Special-Publication-800-53A-Revision-5"},{"@id":"d3f:Reference-NISTIR-8011-Volume-1"}],"d3f:synonym":"Mission Risk Assessment","rdfs:label":"Operational Risk Assessment","rdfs:subClassOf":{"@id":"d3f:OperationalActivityMapping"}}]},"digital_artifacts":{"head":{"vars":["query_def_tech_label","top_def_tech_label","def_tech_label","def_artifact_rel_label","def_artifact_label","def_tactic","def_tactic_rel","def_tech","def_artifact_rel","def_artifact"]},"results":{"bindings":[]}},"subtechniques":{"@context":{"rdfs":"http://www.w3.org/2000/01/rdf-schema#","owl":"http://www.w3.org/2002/07/owl#","d3f":"http://d3fend.mitre.org/ontologies/d3fend.owl#","skos":"http://www.w3.org/2004/02/skos/core#"},"@graph":[]},"related_offensive_matrix":{},"references":{"@context":{"rdfs":"http://www.w3.org/2000/01/rdf-schema#","d3f":"http://d3fend.mitre.org/ontologies/d3fend.owl#"},"@graph":[{"@id":"d3f:Reference-MGT516ManagingSecurityVulnerabilitiesEnterpriseAndCloud","@type":["d3f:InternetArticleReference","http://www.w3.org/2002/07/owl#NamedIndividual"],"d3f:has-link":{"@type":"http://www.w3.org/2001/XMLSchema#anyURI","@value":"https://www.sans.org/cyber-security-courses/managing-enterprise-cloud-security-vulnerabilities/"},"d3f:kb-abstract":"Vulnerability, patch, and configuration management are not new security topics. In fact, they are some of the oldest security functions. Yet, we still struggle to manage these capabilities effectively. The quantity of outstanding vulnerabilities for most large organizations is overwhelming, and all organizations struggle to keep up with the never-ending onslaught of new vulnerabilities in their infrastructure and applications. When you add in the cloud and the increasing speed with which all organizations must deliver systems, applications, and features to both their internal and external customers, security may seem unachievable. This course will show you the most effective ways to mature your vulnerability management program and move from identifying vulnerabilities to successfully treating them. 16 Cyber42 and lab exercises","d3f:kb-author":"Jonathan Risto and David Hazar","d3f:kb-organization":"SANS","d3f:kb-reference-of":{"@id":"d3f:OperationalRiskAssessment"},"d3f:kb-reference-title":"MGT516: Managing Security Vulnerabilities: Enterprise and Cloud","d3f:reference-type-label":"Internet Article","rdfs:label":"Reference - MGT516: Managing Security Vulnerabilities: Enterprise and Cloud"},{"@id":"d3f:Reference-NIST-RMF-Quick-Start-Guide-Assess-Step-FAQ","@type":["d3f:InternetArticleReference","http://www.w3.org/2002/07/owl#NamedIndividual"],"d3f:has-link":{"@type":"http://www.w3.org/2001/XMLSchema#anyURI","@value":"https://csrc.nist.gov/CSRC/media/Projects/risk-management/documents/05-Assess%20Step/NIST%20RMF%20Assess%20Step-FAQs.pdf"},"d3f:kb-abstract":"Once security and privacy controls are implemented, they need to be evaluated for correctness and effectiveness. After the initial assessment is completed and the system enters the operations/maintenance phase of the system development life cycle, the controls are assessed on an ongoing basis according to the organization and system’s continuous monitoring plans. The ongoing assessment supports the authorizing official’s decision to continue or discontinue the system’s authorization to operate. Control effectiveness assessments are performed by an independent third-party assessor or assessment team if the system categorization is moderate or high.","d3f:kb-organization":"NIST","d3f:kb-reference-of":{"@id":"d3f:OperationalRiskAssessment"},"d3f:kb-reference-title":"NIST RMF Quick Start Guide - Assess Step - Frequently Asked Questions (FAQ)","d3f:reference-type-label":"Internet Article","rdfs:label":"Reference - NIST RMF Quick Start Guide - Assess Step - Frequently Asked Questions (FAQ)"},{"@id":"d3f:Reference-NIST-Special-Publication-800-160-Volume-1","@type":["d3f:GuidelineReference","http://www.w3.org/2002/07/owl#NamedIndividual"],"d3f:has-link":{"@type":"http://www.w3.org/2001/XMLSchema#anyURI","@value":"https://doi.org/10.6028/NIST.SP.800-160v1"},"d3f:kb-abstract":"With the continuing frequency, intensity, and adverse consequences of cyber-attacks, disruptions, hazards, and other threats to federal, state, and local governments, the military, businesses, and the critical infrastructure, the need for trustworthy secure systems has never been more important to the long-term economic and national security interests of the United States. Engineering-based solutions are essential to managing the growing complexity, dynamicity, and interconnectedness of today’s systems, as exemplified by cyber-physical systems and systems-of-systems, including the Internet of Things. This publication addresses the engineering-driven perspective and actions necessary to develop more defensible and survivable systems, inclusive of the machine, physical, and human components that compose the systems and the capabilities and services delivered by those systems. It starts with and builds upon a set of well-established International Standards for systems and software engineering published by the International Organization for Standardization (ISO), the International Electrotechnical Commission (IEC), and the Institute of Electrical and Electronics Engineers (IEEE) and infuses systems security engineering methods, practices, and techniques into those systems and software engineering activities. The objective is to address security issues from a stakeholder protection needs, concerns, and requirements perspective and to use established engineering processes to ensure that such needs, concerns, and requirements are addressed with appropriate fidelity and rigor, early and in a sustainable manner throughout the life cycle of the system.","d3f:kb-author":"Ron Ross, Michael McEvilley, and Janet Carrier Oren","d3f:kb-organization":"NIST","d3f:kb-reference-of":{"@id":"d3f:OperationalRiskAssessment"},"d3f:kb-reference-title":"NIST Special Publication 800-160 Volume 1 - Systems Security Engineering","d3f:reference-type-label":"Guideline","rdfs:label":"Reference - NIST Special Publication 800-160 Volume 1 - System Security Engineering"},{"@id":"d3f:Reference-NIST-Special-Publication-800-37-Revision-2","@type":["d3f:GuidelineReference","http://www.w3.org/2002/07/owl#NamedIndividual"],"d3f:has-link":{"@type":"http://www.w3.org/2001/XMLSchema#anyURI","@value":"https://doi.org/10.6028/NIST.SP.800-37r2"},"d3f:kb-abstract":"This publication describes the Risk Management Framework (RMF) and provides guidelines for applying the RMF to information systems and organizations. The RMF provides a disciplined, structured, and flexible process for managing security and privacy risk that includes information security categorization; control selection, implementation, and assessment; system and common control authorizations; and continuous monitoring. The RMF includes activities to prepare organizations to execute the framework at appropriate risk management levels. The RMF also promotes near real-time risk management and ongoing information system and common control authorization through the implementation of continuous monitoring processes; provides senior leaders and executives with the necessary information to make efficient, cost-effective, risk management decisions about the systems supporting their missions and business functions; and incorporates security and privacy into the system development life cycle. Executing the RMF tasks links essential risk management processes at the system level to risk management processes at the organization level. In addition, it establishes responsibility and accountability for the controls implemented within an organization’s information systems and inherited by those systems.","d3f:kb-organization":"NIST","d3f:kb-reference-of":{"@id":"d3f:OperationalRiskAssessment"},"d3f:kb-reference-title":"NIST Special Publication 800-37 Revision 2 - Risk Management Framework for Information Systems and Organizations","d3f:reference-type-label":"Guideline","rdfs:label":"Reference - NIST Special Publication 800-37 Revision 2 - Risk Management Framework for Information Systems and Organizations"},{"@id":"d3f:Reference-NIST-Special-Publication-800-53A-Revision-5","@type":["d3f:GuidelineReference","http://www.w3.org/2002/07/owl#NamedIndividual"],"d3f:has-link":{"@type":"http://www.w3.org/2001/XMLSchema#anyURI","@value":"https://doi.org/10.6028/NIST.SP.800-53Ar5"},"d3f:kb-abstract":"This publication provides a methodology and set of procedures for conducting assessments of security and privacy controls employed within systems and organizations within an effective risk management framework. The assessment procedures, executed at various phases of the system development life cycle, are consistent with the security and privacy controls in NIST Special Publication 800-53, Revision 5. The procedures are customizable and can be easily tailored to provide organizations with the needed flexibility to conduct security and privacy control assessments that support organizational risk management processes and are aligned with the stated risk tolerance of the organization. Information on building effective security and privacy assessment plans is also provided with guidance on analyzing assessment results.","d3f:kb-organization":"NIST","d3f:kb-reference-of":{"@id":"d3f:OperationalRiskAssessment"},"d3f:kb-reference-title":"NIST Special Publication 800-53A Revision 5 - Assessing Security and Privacy Controls in Information Systems and Organizations","d3f:reference-type-label":"Guideline","rdfs:label":"Reference - NIST Special Publication 800-53A Revision 5 - Assessing Security and Privacy Controls in Information Systems and Organizations"},{"@id":"d3f:Reference-NISTIR-8011-Volume-1","@type":["d3f:GuidelineReference","http://www.w3.org/2002/07/owl#NamedIndividual"],"d3f:has-link":{"@type":"http://www.w3.org/2001/XMLSchema#anyURI","@value":"https://doi.org/10.6028/NIST.IR.8011-1"},"d3f:kb-abstract":"This volume introduces concepts to support automated assessment of most of the security controls in NIST Special Publication (SP) 800-53. Referencing SP 800-53A, the controls are divided into more granular parts (determination statements) to be assessed. The parts of the control assessed by each determination statement are called control items. The control items are then grouped into the appropriate security capabilities. As suggested by SP 800-53 Revision 4, security capabilities are groups of controls that support a common purpose. For effective automated assessment, testable defect checks are defined that bridge the determination statements to the broader security capabilities to be achieved and to the SP 800-53 security control items themselves. The defect checks correspond to security sub-capabilities-called sub-capabilities because each is part of a larger capability. Capabilities and sub-capabilities are both designed with the purpose of addressing a series of attack steps. Automated assessments (in the form of defect checks) are performed using the test assessment method defined in SP 800-53A by comparing a desired and actual state (or behavior).","d3f:kb-author":"Kelley Dempsey, Paul Eavy, and George Moore","d3f:kb-organization":"NIST","d3f:kb-reference-of":{"@id":"d3f:OperationalRiskAssessment"},"d3f:kb-reference-title":"NIST Interagency Report 8011 Volume 1 - Automation Support for Security Control Assessments","d3f:reference-type-label":"Guideline","rdfs:label":"Reference - NISTIR 8011 Volume 1 - Automation Support for Security Control Assessments"}]},"references_meta":{"Internet Article":2,"Guideline":4}}